
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Заголовок = "Выберите файл";
	
	Если ДиалогВыбора.Выбрать() Тогда
		ИмяФайла = ДиалогВыбора.ПолноеИмяФайла;
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере()
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Прочитать(ИмяФайла, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	
	ОбластиТаб = ТабДок.Область(1, 1, ТабДок.ВысотаТаблицы, ТабДок.ШиринаТаблицы);

	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластиТаб);  
	Построитель.Выполнить();
	
	ТабДанные = Построитель.Результат.Выгрузить(); 
	
	Набор = РегистрыСведений.ОценкаКачестваОбслуживания.СоздатьНаборЗаписей();
	Набор.Записать();
	
	НаборЗаписей = РегистрыСведений.ОценкаКачестваОбслуживания.СоздатьНаборЗаписей();

	Для Каждого Элем Из ТабДанные Цикл 
		НоваяЗапись = НаборЗаписей.Добавить(); 
		
		НоваяЗапись.Период = Дата(Элем.Дата); 
		НоваяЗапись.Респондент = Элем.Респондент; 
		
		Если Элем.ОбращениеБылоРешено_ = "Да" Тогда 
			НоваяЗапись.ОбращениеРешено = Перечисления.РешеноЛиОбращение.Да;
		ИначеЕсли Элем.ОбращениеБылоРешено_ = "Частично" Тогда 
			НоваяЗапись.ОбращениеРешено = Перечисления.РешеноЛиОбращение.Частично;
		ИначеЕсли Элем.ОбращениеБылоРешено_ = "Нет" Тогда
			НоваяЗапись.ОбращениеРешено = Перечисления.РешеноЛиОбращение.Нет;
		Иначе
			НоваяЗапись.ОбращениеРешено = Перечисления.РешеноЛиОбращение.Другое;	
		КонецЕсли; 
		НоваяЗапись.УдобствоРаботыСОбращениями = Число(Элем.НаСколькоУдобноБылоРаботатьСОбращением_);
		НоваяЗапись.ОценкаСотрудника = Число(Элем.ОценитеСотрудника);
		НоваяЗапись.ПожеланияИПредложения = Элем.ПожеланияИПредложения;
	КонецЦикла; 
	
	НаборЗаписей.Записать();
		
КонецПроцедуры
