
Функция ПолучитьВремяРеакцииНаТекПериод(Обращение, ДатаСеанса) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РАЗНОСТЬДАТ(СостояниеОбращенийСрезПервых.Период, &ТекПериод, МИНУТА) КАК Реакция,
		|	СостояниеОбращенийСрезПервых.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СостояниеОбращений.СрезПервых КАК СостояниеОбращенийСрезПервых
		|ГДЕ
		|	СостояниеОбращенийСрезПервых.Обращение = &Обращение
		|	И СостояниеОбращенийСрезПервых.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбращения.Новое)";
	
	Запрос.УстановитьПараметр("Обращение", Обращение);
	Запрос.УстановитьПараметр("ТекПериод", ДатаСеанса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Число(ВыборкаДетальныеЗаписи.Реакция); 
	КонецЦикла;
	
	Возврат 0;
КонецФункции  

Функция ПолучитьВремяРешенияНаТекПериод(Обращение, ДатаСеанса, Статус) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РАЗНОСТЬДАТ(СостояниеОбращенийСрезПоследних.Период, &ТекПериод, МИНУТА) КАК Решение,
		|	СостояниеОбращенийСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СостояниеОбращений.СрезПоследних КАК СостояниеОбращенийСрезПоследних
		|ГДЕ
		|	СостояниеОбращенийСрезПоследних.Обращение = &Обращение
		|	И СостояниеОбращенийСрезПоследних.Статус = &Статус";
	
	Запрос.УстановитьПараметр("Обращение", Обращение); 
	Запрос.УстановитьПараметр("ТекПериод", ДатаСеанса);
	Запрос.УстановитьПараметр("Статус", Статус);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Число(ВыборкаДетальныеЗаписи.Решение); 
	КонецЦикла;	
	
	Возврат 0 ;
КонецФункции
