///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОписаниеПеременных


Перем ОбработчикПодключен;
Перем ТекстЗапроса Экспорт;

// СтандартныеПодсистемы

// Хранилище глобальных переменных.
//
// ПараметрыПриложения - Соответствие из КлючИЗначение:
//   * Ключ - Строка - имя переменной в формате "ИмяБиблиотеки.ИмяПеременной";
//   * Значение - Произвольный - значение переменной.
//
// Пример инициализации:
//   ИмяПараметра = "СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации";
//   Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
//     ПараметрыПриложения.Вставить(ИмяПараметра, Новый СписокЗначений);
//   КонецЕсли;
//  
// Пример использования:
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"].Добавить(...);
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"] = ...;
Перем ПараметрыПриложения Экспорт;

// Конец СтандартныеПодсистемы

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередНачаломРаботыСистемы()
	
#Если МобильныйКлиент Тогда
	Если ОсновнойСерверДоступен() = Ложь Тогда
		Возврат;
	КонецЕсли;
#КонецЕсли
	
	// СтандартныеПодсистемы
#Если МобильныйКлиент Тогда
	Выполнить("СтандартныеПодсистемыКлиент.ПередНачаломРаботыСистемы()");
#Иначе
	СтандартныеПодсистемыКлиент.ПередНачаломРаботыСистемы();
#КонецЕсли
	// Конец СтандартныеПодсистемы
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	
	// СтандартныеПодсистемы
#Если МобильныйКлиент Тогда
	Выполнить("СтандартныеПодсистемыКлиент.ПриНачалеРаботыСистемы()");
#Иначе
	СтандартныеПодсистемыКлиент.ПриНачалеРаботыСистемы();
#КонецЕсли	// Конец СтандартныеПодсистемы
ПодключитьОбработчикОжидания("ПроверитьОповещения", 10);
ПроверитьОповещения();
КонецПроцедуры 


Процедура ОбработатьОповещение(Канал, Данные) Экспорт
    
    Если Канал = "ПоказатьОповещение" Тогда
        
        Заголовок = Данные.Заголовок;
        Текст = Данные.Текст;
        НавигационнаяСсылка = Данные.НавигационнаяСсылка;
        УникальныйКлюч = Данные.УникальныйКлюч;
        
        Если ПустаяСтрока(НавигационнаяСсылка) Тогда
            НавигационнаяСсылка = "";
        КонецЕсли;
        
        ПоказатьОповещениеПользователя(
            Заголовок,
            НавигационнаяСсылка,
            Текст,
            БиблиотекаКартинок.Информация,
            СтатусОповещенияПользователя.Важное,
            УникальныйКлюч
        );
        
        
    КонецЕсли;
    
КонецПроцедуры

Процедура ПроверитьОповещения() Экспорт
    
    // Получаем непрочитанные оповещения с сервера
    МассивОповещений = ОповещенияСервер.ПолучитьНепрочитанныеОповещения();
    
    // Показываем каждое оповещение
    Для Каждого Оповещение Из МассивОповещений Цикл
        
        НавигационнаяСсылка = Оповещение.НавигационнаяСсылка;
        Если ПустаяСтрока(НавигационнаяСсылка) Тогда
            НавигационнаяСсылка = "";
        КонецЕсли;
        
        // Показываем оповещение пользователю
        ПоказатьОповещениеПользователя(
            Оповещение.Заголовок,
            НавигационнаяСсылка,
            Оповещение.ТекстОповещения,
            БиблиотекаКартинок.Информация,
            СтатусОповещенияПользователя.Важное,
            Оповещение.УникальныйКлюч
        );
        
        // Звуковой сигнал
        
        // Отмечаем как прочитанное
        ОповещенияСервер.ОтметитьКакПрочитанное(
            Оповещение.Пользователь,
            Оповещение.ВремяСобытия,
            Оповещение.УникальныйКлюч
        );
        
    КонецЦикла;
    
КонецПроцедуры
Процедура ПроверкаОповещенийПоТаймеру()
    
    // Вызываем процедуру из общего модуля
    ОповещенияКлиент.ПроверитьНовыеОповещения();
    
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	
	// СтандартныеПодсистемы
#Если МобильныйКлиент Тогда
	Выполнить("СтандартныеПодсистемыКлиент.ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)");
#Иначе
	СтандартныеПодсистемыКлиент.ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения);
#КонецЕсли 
//ОбработкаОповещенийКлиент.ОтключитьОбработчикОповещений();
// Конец СтандартныеПодсистемы
	
КонецПроцедуры

Процедура ОбработкаПолученияФормыВыбораПользователейСистемыВзаимодействия(НазначениеВыбора,
			Форма, ИдентификаторОбсуждения, Параметры, ВыбраннаяФорма, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы
#Если МобильныйКлиент Тогда
	Выполнить("СтандартныеПодсистемыКлиент.ОбработкаПолученияФормыВыбораПользователейСистемыВзаимодействия(НазначениеВыбора,
		|Форма, ИдентификаторОбсуждения, Параметры, ВыбраннаяФорма, СтандартнаяОбработка)");
#Иначе
	СтандартныеПодсистемыКлиент.ОбработкаПолученияФормыВыбораПользователейСистемыВзаимодействия(НазначениеВыбора,
		Форма, ИдентификаторОбсуждения, Параметры, ВыбраннаяФорма, СтандартнаяОбработка);
#КонецЕсли
	// Конец СтандартныеПодсистемы
	
КонецПроцедуры

Процедура ПриГлобальномПоиске(СтрокаПоиска, ПланПоиска)
	
		// СтандартныеПодсистемы
#Если МобильныйКлиент Тогда
	Выполнить("СтандартныеПодсистемыКлиент.ПриГлобальномПоиске(СтрокаПоиска, ПланПоиска)");
#Иначе
	СтандартныеПодсистемыКлиент.ПриГлобальномПоиске(СтрокаПоиска, ПланПоиска);
#КонецЕсли
	// Конец СтандартныеПодсистемы
	
КонецПроцедуры

Процедура ПриВыбореРезультатаГлобальногоПоиска(ЭлементРезультата, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы
#Если МобильныйКлиент Тогда
	Выполнить("СтандартныеПодсистемыКлиент.ПриВыбореРезультатаГлобальногоПоиска(ЭлементРезультата,
		|СтандартнаяОбработка)");
#Иначе
	СтандартныеПодсистемыКлиент.ПриВыбореРезультатаГлобальногоПоиска(ЭлементРезультата,
		СтандартнаяОбработка);
#КонецЕсли
	// Конец СтандартныеПодсистемы

КонецПроцедуры

Процедура ПриВыбореДействияРезультатаГлобальногоПоиска(ЭлементРезультата, Действие)
	
	// СтандартныеПодсистемы
#Если МобильныйКлиент Тогда
	Выполнить("СтандартныеПодсистемыКлиент.ПриВыбореДействияРезультатаГлобальногоПоиска(ЭлементРезультата,
		|Действие)");
#Иначе
	СтандартныеПодсистемыКлиент.ПриВыбореДействияРезультатаГлобальногоПоиска(ЭлементРезультата, Действие);
#КонецЕсли
	// Конец СтандартныеПодсистемы

КонецПроцедуры

Процедура ОбработкаПереходаПоНавигационнойСсылке(ДанныеПереходаПоНавигационнойСсылке, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы
#Если МобильныйКлиент Тогда
	Выполнить("СтандартныеПодсистемыКлиент.ОбработкаПереходаПоНавигационнойСсылке(ДанныеПереходаПоНавигационнойСсылке,
		|СтандартнаяОбработка)");
#Иначе
	СтандартныеПодсистемыКлиент.ОбработкаПереходаПоНавигационнойСсылке(ДанныеПереходаПоНавигационнойСсылке,
		СтандартнаяОбработка);
#КонецЕсли
	// Конец СтандартныеПодсистемы
	
КонецПроцедуры

#КонецОбласти  