
Функция ОтправитьЗапросИСоздатьОбращениеНаСервере(СсылкаИсточника, ЧатИД)
    
    // Отправляем запрос к ML-серверу
    ОтветСервера = СРОО_ОбщегоНазначения.ОтправитьЗапросКСерверу(СсылкаИсточника.ТекстОбращения, СсылкаИсточника);
    Если ОтветСервера = Неопределено Тогда
        Возврат Ложь;
    КонецЕсли;
    
    // Создаем обращение в базе данных
    Результат = СРОО_ОбщегоНазначения.СоздатьОбращениеВБазе(СсылкаИсточника.ТекстОбращения, ОтветСервера, СсылкаИсточника, ЧатИД);
    
    Возврат Результат;
    
КонецФункции

Процедура ОбработкаНовыхОбращений(СсылкаНаОбращение = Неопределено, ЧатИД = Неопределено) Экспорт
	ТекстЗапроса = "ВЫБРАТЬ
		|	ИсточникиОбращений.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИсточникиОбращений КАК ИсточникиОбращений
		|ГДЕ
		|	ИсточникиОбращений.Статус = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.СтатусыОбработки.КОбработке)";
	
	Запрос = Новый Запрос;
	
	Если ЗначениеЗаполнено(СсылкаНаОбращение) Тогда
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + "И ИсточникиОбращений.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбращение); 
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОтправитьЗапросИСоздатьОбращениеНаСервере(ВыборкаДетальныеЗаписи.Ссылка, ЧатИД);
	КонецЦикла;
КонецПроцедуры
