
Функция ОтправитьОтзыв(ВопросПользователя, ИспользованиеGigachat) Экспорт
	
	СтруктураОтветовВозврат = Новый Соответствие;
	СтруктураОтветовВозврат.Вставить("ОтветСобственной", ""); 
	СтруктураОтветовВозврат.Вставить("ОтветGigaChat", ""); 
	СтруктураОтветовВозврат.Вставить("ВопросПользователя", ВопросПользователя); 
	СтруктураОтветовВозврат.Вставить("КодСостоянияGigaChat", 0); 
	СтруктураОтветовВозврат.Вставить("КодСостоянияruBERT", 0); 
	СтруктураОтветовВозврат.Вставить("ОписаниеGigaChat", ""); 
	СтруктураОтветовВозврат.Вставить("ОписаниеruBERT", "");  
	СтруктураОтветовВозврат.Вставить("ЕстьОшибкиGigaChat", Ложь); 
	СтруктураОтветовВозврат.Вставить("ЕстьОшибкиruBERT", Ложь); 
	МассивВопросов = Новый Массив; 
	МассивВопросов.Добавить(ВопросПользователя);
	Если НЕ ИспользованиеGigachat = Перечисления.ИспользованиеGigachat.ТолькоGigachat Тогда 
		#Область ЗапросКСобственнойМоделе
		
		Если Константы.ПротоколЗапросаruBERT.Получить() = "https" Тогда 
			ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
			Соединение = Новый HTTPСоединение(Константы.ИмяСервераЗапросаruBERT.Получить(),,,,,90,ЗащищенноеСоединение); 	
		ИначеЕсли Константы.ПротоколЗапросаruBERT.Получить() = "http" Тогда  
			Соединение = Новый HTTPСоединение(Константы.ИмяСервераЗапросаruBERT.Получить(),,,,,90); 
		КонецЕсли;
		#Область ТелоЗапроса 
		
		payload = Новый Структура;
		
		// Вот тут задается вопрос боту {
		//Если МассивИзМодуля Тогда
		//	payload.Вставить("text", ВопросПользователя);
		//Иначе
		МассивЗначений = Новый Массив;
		МассивЗначений.Добавить(ВопросПользователя);
		payload.Вставить("text", МассивЗначений);  
		//КонецЕсли;
		// } Вот тут задается вопрос боту 	
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, payload); 
		
		СтрокаJSON = ЗаписьJSON.Закрыть(); 
		
		#КонецОбласти
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type", "application/json");
		
		Запрос = Новый HTTPЗапрос("/" + Константы.ПутьКФайлуruBERT.Получить(), Заголовки); 
		Запрос.УстановитьТелоИзСтроки(СтрокаJSON);
		
		Попытка
			Ответ = Соединение.ВызватьHTTPМетод("POST",	Запрос);  
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось отправить запрос по следующей причине: " + ОписаниеОшибки();
			Сообщение.Сообщить();  
			
			СтруктураОтветовВозврат["ЕстьОшибкиruBERT"] = Истина;
			СтруктураОтветовВозврат["ОписаниеruBERT"] = Сообщение.Текст;
		КонецПопытки;
		
		Если СтруктураОтветовВозврат["ЕстьОшибкиruBERT"] = Ложь Тогда 
			
			Если Ответ.КодСостояния = 200 Тогда 
				
				СтруктураОтветовВозврат["КодСостоянияruBERT"] = 200;
				ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
				
				ДанныеСоответствия = ПрочитатьJSON(ЧтениеJSON, Истина); 
				
				СтруктураОтветовВозврат["ОтветСобственной"] = ДанныеСоответствия["prediction"];
				
			Иначе
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Не удалось выполнить запрос, код состояния: %1, ответ сервера: %2",
				Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку());
				Сообщение.Сообщить();
				СтруктураОтветовВозврат["ЕстьОшибкиruBERT"] = Истина;
				СтруктураОтветовВозврат["КодСостоянияruBERT"] = Ответ.КодСостояния;
				СтруктураОтветовВозврат["ОписаниеruBERT"] = Сообщение.Текст;
			КонецЕсли;	
			
		КонецЕсли;
		#КонецОбласти	
	КонецЕсли;
	
	Если НЕ ИспользованиеGigachat = Перечисления.ИспользованиеGigachat.Отключено Тогда 	
		#Область ЗапросGigachat
		
		ТокенДоступа = Неопределено;
		
		#Область ПолучениеТокенаДоступа 
		
		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
		Соединение = Новый HTTPСоединение("ngw.devices.sberbank.ru:9443",,,,,90,ЗащищенноеСоединение); 
		
		КлючАвторизации = Константы.КлючАвторизацииGigaChat.Получить(); 
		Scope = Константы.ScopeGigaChat.Получить();
		
		#Область Заголовки
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
		Заголовки.Вставить("Accept", "application/json");
		Заголовки.Вставить("RqUID", Новый УникальныйИдентификатор);
		Заголовки.Вставить("Authorization", "Basic " + КлючАвторизации);
		#КонецОбласти
		
		Запрос = Новый HTTPЗапрос("/api/v2/oauth", Заголовки);  
		Запрос.УстановитьТелоИзСтроки("scope=" + Scope);
		
		Попытка
			Ответ = Соединение.ВызватьHTTPМетод("POST",	Запрос);  
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось отправить запрос по следующей причине: " + ОписаниеОшибки();
			Сообщение.Сообщить(); 
			
			СтруктураОтветовВозврат["ЕстьОшибкиGigaChat"] = Истина;
			СтруктураОтветовВозврат["ОписаниеGigaChat"] = Сообщение.Текст;
		КонецПопытки;
		
		Если Ответ.КодСостояния = 200 Тогда 
			
			СтруктураОтветовВозврат["КодСостоянияGigaChat"] = 200;
			ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
			
			ДанныеСоответствия = ПрочитатьJSON(ЧтениеJSON, Истина); 
			ТокенДоступа = ДанныеСоответствия["access_token"];
			
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Не удалось выполнить запрос, код состояния: %1, ответ сервера: %2",
			Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку());
			Сообщение.Сообщить(); 
			
			СтруктураОтветовВозврат["ЕстьОшибкиGigaChat"] = Истина;
			СтруктураОтветовВозврат["КодСостоянияGigaChat"] = Ответ.КодСостояния;
            СтруктураОтветовВозврат["ОписаниеGigaChat"] = Сообщение.Текст;
		КонецЕсли;
		#КонецОбласти 
		
		#Область ОтправкаОтзываНейронке
		
		Если НЕ ТокенДоступа = Неопределено Тогда 
			
			ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
			Соединение = Новый HTTPСоединение("gigachat.devices.sberbank.ru",,,,,90,ЗащищенноеСоединение); 
			
			#Область ТелоЗапросаСтрокаJSON
			payload = Новый Структура;
			payload.Вставить("model", "GigaChat");
			
			// Вот тут задается вопрос боту {
			ВопросКИИ = "Оцени отзыв сперва словом: ""отзыв можно оценить как"" ""положительный"", ""нейтральный"" или ""отрицательный"". Затем подробно прокоментируй свой выбор. Отзыв: " + ВопросПользователя;
			СтруктураСВопросом = Новый Структура;
			СтруктураСВопросом.Вставить("role", "user"); 
			СтруктураСВопросом.Вставить("content", ВопросКИИ);
			МассивЗначений = Новый Массив;
			МассивЗначений.Добавить(СтруктураСВопросом);
			payload.Вставить("messages", МассивЗначений);
			// } Вот тут задается вопрос боту 
			
			payload.Вставить("stream", Ложь);
			payload.Вставить("repetition_penalty", 1);
			
			
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
			ЗаписатьJSON(ЗаписьJSON, payload); 
			
			СтрокаJSON = ЗаписьJSON.Закрыть(); 
			#КонецОбласти
			
			#Область Заголовки
			Заголовки = Новый Соответствие;
			Заголовки.Вставить("Content-Type", "application/json");
			Заголовки.Вставить("Accept", "application/json");
			Заголовки.Вставить("Authorization", "Bearer " + ТокенДоступа);
			#КонецОбласти
			
			Запрос = Новый HTTPЗапрос("/api/v1/chat/completions", Заголовки); 
			Запрос.УстановитьТелоИзСтроки(СтрокаJSON);
			
			Попытка
				Ответ = Соединение.ВызватьHTTPМетод("POST",	Запрос);  
			Исключение
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не удалось отправить запрос по следующей причине: " + ОписаниеОшибки();
				Сообщение.Сообщить();
				
				СтруктураОтветовВозврат["ЕстьОшибкиGigaChat"] = Истина;
				СтруктураОтветовВозврат["ОписаниеGigaChat"] = Сообщение.Текст;
			КонецПопытки;
			
			Если Ответ.КодСостояния = 200 Тогда 
				
				СтруктураОтветовВозврат["КодСостоянияGigaChat"] = 200;
				ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
				
				ДанныеСоответствия = ПрочитатьJSON(ЧтениеJSON, Истина); 
				
				МассивОтвета = ДанныеСоответствия["choices"];
				Для каждого НейроОтвет Из МассивОтвета Цикл 
					СтруктураОтветовВозврат["ОтветGigaChat"] = НейроОтвет["message"]["content"];			
				КонецЦикла;
				
			Иначе
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Не удалось выполнить запрос, код состояния: %1, ответ сервера: %2",
				Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку());
				Сообщение.Сообщить();
				
				СтруктураОтветовВозврат["ЕстьОшибкиGigaChat"] = Истина;
				СтруктураОтветовВозврат["КодСостоянияGigaChat"] = Ответ.КодСостояния;
            	СтруктураОтветовВозврат["ОписаниеGigaChat"] = Сообщение.Текст;
			КонецЕсли;
			
		КонецЕсли;
		#КонецОбласти
		
		#КонецОбласти	
	КонецЕсли; 
	ТекстXML = ОбщегоНазначения.ЗначениеВСтрокуXML(СтруктураОтветовВозврат);
	Возврат ТекстXML;	
КонецФункции
