
&НаКлиенте
Процедура ПолучитьПисьма(Команда)
	ПолучитьПисьмаНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПолучитьПисьмаНаСервере()
	ПоследняяДатаПолученияПисем = Константы.ПоследняяДатаПолученияПисем.Получить();
	Константы.ПоследняяДатаПолученияПисем.Установить(ТекущаяДата());
	Если НЕ ЗначениеЗаполнено(ПоследняяДатаПолученияПисем) Тогда
		ПоследняяДатаПолученияПисем = НачалоДня(ТекущаяДата());
	КонецЕсли;
	ПараметрыЗагрузки = новый Структура;
	СтруктураОтбора= новый Структура;
	СтруктураОтбора.Вставить("ПослеДатыОтправления", ПоследняяДатаПолученияПисем);
	
	ПараметрыЗагрузки.Вставить("Отбор", СтруктураОтбора);
	
	ПолученныеПисьма = РаботаСПочтовымиСообщениями.ЗагрузитьПочтовыеСообщения(
				Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты,
				ПараметрыЗагрузки);
	Для каждого Строка ИЗ ПолученныеПисьма Цикл
		Если Строка.ДатаОтправления < ПоследняяДатаПолученияПисем Тогда
			Продолжить;	
		КонецЕсли;
		НовыйЭлемент = Справочники.ИсточникиОбращений.СоздатьЭлемент();
		ПолученныйТекст = Строка.Тексты[0].Получить("Текст");
		ПолученныйТекст_Фильтр = СтрЗаменить(ПолученныйТекст, "<div>", "");
		ПолученныйТекст_Фильтр = СтрЗаменить(ПолученныйТекст_Фильтр, "</div>", "");
		НовыйЭлемент.ТекстОбращения = ПолученныйТекст_Фильтр;
		НовыйЭлемент.ТемаОбращения = Строка.Тема;
		НовыйЭлемент.ИсточникОбращения = Перечисления.ИсточникиОбращений.Почта;
		НовыйЭлемент.АвторОбращения = Строка.ИмяОтправителя;
		НовыйЭлемент.СсылкаНаАвтора = СРОО_ОбщегоНазначения.ПолучитьАвтораПоФИО(Строка.ИмяОтправителя);
		НовыйЭлемент.Статус = Перечисления.СтатусыОбработки.КОбработке;      
		
		НовСтр = НовыйЭлемент.ДопСвойства.Добавить();
		НовСтр.Свойство = "Отправитель";
		НовСтр.Значение = Строка.Отправитель;
		
		НовСтр = НовыйЭлемент.ДопСвойства.Добавить();
		НовСтр.Свойство = "Идентификатор";
		НовСтр.Значение = Строка.Идентификатор[0];
		НовыйЭлемент.Наименование = СтрШаблон("Обращение №%1 Почта", НовыйЭлемент.ТемаОбращения);
		НовыйЭлемент.Записать();
		НовыйЭлемент.Наименование = СтрШаблон("Обращение №%1 Почта", НовыйЭлемент.Код);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеПисьма(Команда)
	УдалитьВсеПисьмаНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура УдалитьВсеПисьмаНаСервере()
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ Справочник.ПочтовыеСообщения";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПисьмоОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		ПисьмоОбъект.Удалить();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтветитьНаПисьмо(Команда)
	ОткрытьФорму("ОбщаяФорма.ОтправкаСообщения");
КонецПроцедуры
