
&НаКлиенте
Процедура ПолучитьПисьма(Команда)
	ПолучитьПисьмаНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПолучитьПисьмаНаСервере()
	ПоследняяДатаПолученияПисем = Константы.ПоследняяДатаПолученияПисем.Получить();
	Константы.ПоследняяДатаПолученияПисем.Установить(ТекущаяДата());
	Если НЕ ЗначениеЗаполнено(ПоследняяДатаПолученияПисем) Тогда
		ПоследняяДатаПолученияПисем = НачалоДня(ТекущаяДата());
	КонецЕсли;
	ПараметрыЗагрузки = новый Структура;
	СтруктураОтбора= новый Структура;
	СтруктураОтбора.Вставить("ПослеДатыОтправления", ПоследняяДатаПолученияПисем);
	
	ПараметрыЗагрузки.Вставить("Отбор", СтруктураОтбора);
	
	ПолученныеПисьма = РаботаСПочтовымиСообщениями.ЗагрузитьПочтовыеСообщения(
				Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты,
				ПараметрыЗагрузки);
	Для каждого Строка ИЗ ПолученныеПисьма Цикл
		Если Строка.ДатаОтправления < ПоследняяДатаПолученияПисем Тогда
			Продолжить;	
		КонецЕсли;
		НовыйЭлемент = Справочники.ПочтовыеСообщения.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, Строка);
		ПолученныйТекст = Строка.Тексты[0].Получить("Текст");
		ПолученныйТекст_Фильтр = СтрЗаменить(ПолученныйТекст, "<div>", "");
		ПолученныйТекст_Фильтр = СтрЗаменить(ПолученныйТекст_Фильтр, "</div>", "");
		НовыйЭлемент.Идентификатор = Строка.Идентификатор[0];
		НовыйЭлемент.Тексты = ПолученныйТекст_Фильтр;
		НовыйЭлемент.Заголовок = Строка.Тема;
		НовыйЭлемент.Записать();		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеПисьма(Команда)
	УдалитьВсеПисьмаНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура УдалитьВсеПисьмаНаСервере()
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ Справочник.ПочтовыеСообщения";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПисьмоОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		ПисьмоОбъект.Удалить();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтветитьНаПисьмо(Команда)
	ОткрытьФорму("ОбщаяФорма.ОтправкаСообщения");
КонецПроцедуры
