
Процедура ПриЗаписи(Отказ)
	Если Не Отказ Тогда 
		НаборЗаписей = РегистрыСведений.СостояниеОбращений.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Обращение.Установить(Ссылка); 
		НаборЗаписей.Отбор.Период.Установить(ТекущаяДатаСеанса());
	
		Запись = НаборЗаписей.Добавить(); 
		Запись.Период = ТекущаяДатаСеанса();
		Если Статус = Перечисления.СтатусыОбращения.Новое Тогда 
			Запись.Сотрудник = Справочники.Сотрудники.СистемныйПользователь;
			Запись.СлужебныйКомментарий = СтрШаблон("Создано новое обращение. Автор обращения: %1", Автор);
		ИначеЕсли Статус = Перечисления.СтатусыОбращения.ВРаботе Тогда 
			Запись.СлужебныйКомментарий = СтрШаблон("Обращение взято в работу. Исполнитель: %1", Исполнитель);
			Запись.Сотрудник = Исполнитель;
		КонецЕсли; 
		Запись.Обращение = Ссылка;
		Запись.Статус = Статус;
		НаборЗаписей.Записать();
	КонецЕсли;
КонецПроцедуры
