//Прокси сервер засунул в пароль. Пример curl запроса
//curl "https://generativelanguage.googleapis.com/v1beta/models/gemini-2.5-flash:generateContent" \
//  -H "x-goog-api-key: $GEMINI_API_KEY" \
//  -H 'Content-Type: application/json' \
//  -X POST \
//  -d '{
//    "contents": [
//      {
//        "parts": [
//          {
//            "text": "Explain how AI works in a few words"
//          }
//        ]
//      }
//    ]
//  }'
Функция ПолучитьСообщениеGemini(ТекстСообщения) Экспорт
	НастройкиПодключения = Справочники.НастройкиПодключения.ПолучитьНастройкиПодключения(Справочники.НастройкиПодключения.ПодключениеGemini);
	НастройкиПодключения_Прокси = Справочники.НастройкиПодключения.ПолучитьНастройкиПодключения(Справочники.НастройкиПодключения.Прокси);
	Заголовки = НастройкиПодключения.Заголовки;
	Если ЗначениеЗаполнено(НастройкиПодключения.Пароль) Тогда
		ИнетрнетПрокси = новый ИнтернетПрокси;
		ИнетрнетПрокси.Установить("https" , НастройкиПодключения_Прокси.URL, НастройкиПодключения_Прокси.Порт, НастройкиПодключения_Прокси.Логин, НастройкиПодключения_Прокси.Пароль, Ложь);
	КонецЕсли;
	Соединение = Новый HTTPСоединение(НастройкиПодключения.URL, , ,,ИнетрнетПрокси,15,Новый ЗащищенноеСоединениеOpenSSL);
	ЗапросHTTP = новый HTTPЗапрос(НастройкиПодключения.ВызываемыеМетоды[0], Заголовки);
	
	ТекстЗапроса = новый Структура;
	ТекстЗапроса.Вставить("text" , ТекстСообщения);
	
	ЧастьЗапроса = новый Массив;
	ЧастьЗапроса.Добавить(ТекстЗапроса);
	
	ЧастиЗапроса = Новый Структура;
	ЧастиЗапроса.Вставить("parts", ЧастьЗапроса);
	
	КонтентЗапроса = новый Массив;
	КонтентЗапроса.Добавить(ЧастиЗапроса);
	
	КонтентыЗапроса = новый Структура;
	КонтентыЗапроса.Вставить("contents", КонтентЗапроса);
	
	ЗаписьJSON = новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
    ЗаписатьJSON(ЗаписьJSON, КонтентыЗапроса);
	
	СтрокаЗапроса = ЗаписьJSON.Закрыть();

	
	ЗапросHTTP.УстановитьТелоИзСтроки(СтрокаЗапроса);
	
	Ответ = Соединение.ОтправитьДляОбработки(ЗапросHTTP);
	
	Если НЕ Ответ.КодСостояния = 200 Тогда
		
		Возврат Ответ.ПолучитьТелоКакСтроку();
				
	КонецЕсли;  
	
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
	РезультатЧтения = ПрочитатьJSON(ЧтениеJSON, Истина);
	ОтветМодели = РезультатЧтения.Получить("candidates")[0].Получить("content").Получить("parts")[0].Получить("text");
	Возврат ОтветМодели;
КонецФункции

Процедура ОбновитьСписокКлиентов() Экспорт
	CRMПодключение = Справочники.НастройкиПодключения.AmoCRM;
	НастройкиПодключения = ИнтеграцииПовтИсп.ПолучитьНастройкиПодключения(CRMПодключение);
	ТокенАвторизации = НастройкиПодключения.ТокенДоступа;
	Заголовки = новый Соответствие;
	Заголовки.Вставить("Authorization", ТокенАвторизации);
	ЗащищенноеСоединение = новый ЗащищенноеСоединениеOpenSSL;
	СоединениеHTTP = новый HTTPСоединение(НастройкиПодключения.URL,
										  ,
										  ,
										  ,
										  ,
										  30,
										  ЗащищенноеСоединение);
	HTTPЗапрос = новый HTTPЗапрос(НастройкиПодключения.ВызываемыеМетоды[0], Заголовки);
	Ответ = СоединениеHTTP.Получить(HTTPЗапрос);
	
	ЧтениеJSON = новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	РезультатЧтения = ПрочитатьJSON(ЧтениеJSON,Истина);
	ЧтениеJSON.Закрыть();
	
	СписокКонтактов = РезультатЧтения.Получить("_embedded").Получить("contacts");
	
	ТЗID = новый ТаблицаЗначений;
	ТЗID.Колонки.Добавить("IDКлиента", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(20)));
	СоответствиеПользователей = Новый Соответствие;
	Для каждого Контакт Из СписокКонтактов Цикл
		НСтр = ТЗID.Добавить();
		НСтр.IDКлиента = Контакт.Получить("id");		
		СоответствиеПользователей.Вставить(НСтр.IDКлиента, Контакт);
	КонецЦикла;
	
	ТЗ = ПолучитьАктуальныйСписокКонтактовCRM(ТЗID);
	//Заполним справочник.
	Для каждого Строка ИЗ ТЗ Цикл
		Если Строка.КлиентСоздан Тогда
			СправочникОбъект = Строка.Ссылка.ПолучитьОбъект();
		Иначе
			СправочникОбъект = Справочники.КлиентыCRM.СоздатьЭлемент();
		КонецЕсли;       
		
		Для каждого Элемент ИЗ СоответствиеПользователей.Получить(Строка.IDКлиента).Получить("custom_fields_values") Цикл
			Если Элемент.Получить("field_name") = "Должность" Тогда
				Продолжить;
			КонецЕсли;
			Нстр = СправочникОбъект.КонтактнаяИнформация.Добавить();
			
			Если Элемент.Получить("field_name") = "Телефон" Тогда
				
				Нстр.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонПользователя;
				Нстр.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
				Нстр.Представление = "Телефон";
				Нстр.НомерТелефона = Элемент.Получить("values")[0].Получить("value");				
			ИначеЕсли Элемент.Получить("field_name") = "Email" Тогда
				Нстр.Представление = "Электронная почта";
				Нстр.Вид = Справочники.ВидыКонтактнойИнформации.EmailПользователя;
				Нстр.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
				НСтр.АдресЭП = Элемент.Получить("values")[0].Получить("value");
			КонецЕсли;
		КонецЦикла;
		СправочникОбъект.Код = Строка.IDКлиента;
		СправочникОбъект.Наименование = СоответствиеПользователей.Получить(Строка.IDКлиента).Получить("name");
		
		СправочникОбъект.Записать();
		
		
	КонецЦикла;
КонецПроцедуры                       

Функция ПолучитьАктуальныйСписокКонтактовCRM(ТЗID)
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗID.IDКлиента КАК IDКлиента
	               |ПОМЕСТИТЬ ВТТЗ
	               |ИЗ
	               |	&ТЗID КАК ТЗID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КлиентыCRM.Ссылка КАК Ссылка,
	               |	ИСТИНА КАК КлиентСоздан,
	               |	ВТТЗ.IDКлиента КАК IDКлиента
	               |ПОМЕСТИТЬ ВТПодитоги
	               |ИЗ
	               |	Справочник.КлиентыCRM КАК КлиентыCRM
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТЗ КАК ВТТЗ
	               |		ПО (ВТТЗ.IDКлиента = КлиентыCRM.Код)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КлиентыCRM.Ссылка,
	               |	ЛОЖЬ,
	               |	ВТТЗ.IDКлиента
	               |ИЗ
	               |	Справочник.КлиентыCRM КАК КлиентыCRM
	               |		ПРАВОЕ СОЕДИНЕНИЕ ВТТЗ КАК ВТТЗ
	               |		ПО (ВТТЗ.IDКлиента = КлиентыCRM.Код)
	               |ГДЕ
	               |	КлиентыCRM.Ссылка ЕСТЬ NULL
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТПодитоги.Ссылка КАК Ссылка,
	               |	ВТПодитоги.КлиентСоздан КАК КлиентСоздан,
				   |    ВТПодитоги.IDКлиента
	               |ИЗ
	               |	ВТПодитоги КАК ВТПодитоги";
	Запрос.УстановитьПараметр("ТЗID", ТЗID);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
//ТекстВопроса - Строка - Вопрос пользователя.
Функция ПолучитьБыстрыйОтвет(ТекстВопроса) Экспорт   

	СоединениеHTTP = новый HTTPСоединение("localhost" , 8000);
	Заголовки = новый Соответствие;
	Заголовки.Вставить("Content-Type" , "application/json");
	
	ЗапросHTTP = новый HTTPЗапрос("/fast_answer" , Заголовки);
	
	СтруктураЗапроса = новый Структура;
	СтруктураЗапроса.Вставить("text", ТекстВопроса);
	
	ЗаписьJSON = новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
    ЗаписатьJSON(ЗаписьJSON, СтруктураЗапроса);
	
	СтрокаЗапроса = ЗаписьJSON.Закрыть();
	ЗапросHTTP.УстановитьТелоИзСтроки(СтрокаЗапроса);
	Ответ = СоединениеHTTP.ОтправитьДляОбработки(ЗапросHTTP);
	
	Возврат Ответ.ПолучитьТелоКакСтроку();

КонецФункции

