//Прокси сервер засунул в пароль. Пример curl запроса
//curl "https://generativelanguage.googleapis.com/v1beta/models/gemini-2.5-flash:generateContent" \
//  -H "x-goog-api-key: $GEMINI_API_KEY" \
//  -H 'Content-Type: application/json' \
//  -X POST \
//  -d '{
//    "contents": [
//      {
//        "parts": [
//          {
//            "text": "Explain how AI works in a few words"
//          }
//        ]
//      }
//    ]
//  }'
Функция ПолучитьСообщениеGemini(ТекстСообщения) Экспорт
	НастройкиПодключения = Справочники.НастройкиПодключения.ПолучитьНастройкиПодключения(Справочники.НастройкиПодключения.ПодключениеGemini);
	НастройкиПодключения_Прокси = Справочники.НастройкиПодключения.ПолучитьНастройкиПодключения(Справочники.НастройкиПодключения.Прокси);
	Заголовки = НастройкиПодключения.Заголовки;
	Если ЗначениеЗаполнено(НастройкиПодключения.Пароль) Тогда
		ИнетрнетПрокси = новый ИнтернетПрокси;
		ИнетрнетПрокси.Установить("https" , НастройкиПодключения_Прокси.URL, НастройкиПодключения_Прокси.Порт, НастройкиПодключения_Прокси.Логин, НастройкиПодключения_Прокси.Пароль, Ложь);
	КонецЕсли;
	Соединение = Новый HTTPСоединение(НастройкиПодключения.URL, , ,,ИнетрнетПрокси,15,Новый ЗащищенноеСоединениеOpenSSL);
	ЗапросHTTP = новый HTTPЗапрос(НастройкиПодключения.ВызываемыеМетоды[0], Заголовки);
	
	ТекстЗапроса = новый Структура;
	ТекстЗапроса.Вставить("text" , ТекстСообщения);
	
	ЧастьЗапроса = новый Массив;
	ЧастьЗапроса.Добавить(ТекстЗапроса);
	
	ЧастиЗапроса = Новый Структура;
	ЧастиЗапроса.Вставить("parts", ЧастьЗапроса);
	
	КонтентЗапроса = новый Массив;
	КонтентЗапроса.Добавить(ЧастиЗапроса);
	
	КонтентыЗапроса = новый Структура;
	КонтентыЗапроса.Вставить("contents", КонтентЗапроса);
	
	ЗаписьJSON = новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
    ЗаписатьJSON(ЗаписьJSON, КонтентыЗапроса);
	
	СтрокаЗапроса = ЗаписьJSON.Закрыть();

	
	ЗапросHTTP.УстановитьТелоИзСтроки(СтрокаЗапроса);
	
	Ответ = Соединение.ОтправитьДляОбработки(ЗапросHTTP);
	
	Если НЕ Ответ.КодСостояния = 200 Тогда
		
		Возврат Ответ.ПолучитьТелоКакСтроку();
				
	КонецЕсли;  
	
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
	РезультатЧтения = ПрочитатьJSON(ЧтениеJSON, Истина);
	ОтветМодели = РезультатЧтения.Получить("candidates")[0].Получить("content").Получить("parts")[0].Получить("text");
	Возврат ОтветМодели;
КонецФункции

