  
&НаКлиенте
Процедура Принять(Команда)
	
	ПринятьНаСервере();  
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПринятьНаСервере()
	
	Если Регистратор = Документы.РаботаПоОбращению.ПустаяСсылка() Тогда
		
		НовДок = Документы.РаботаПоОбращению.СоздатьДокумент();
		НовДок.Обращение = Обращение;
		НовДок.Исполнитель = Исполнитель;
		НовДок.Часы = Часы;
		НовДок.ДатаРабот = ДатаРабот;
		НовДок.Комментарий = Комментарий;     
		НовДок.Дата = ТекущаяДатаСеанса();
		НовДок.Записать(РежимЗаписиДокумента.Проведение);
		
	Иначе
		
		НовДок = Регистратор.ПолучитьОбъект();
		НовДок.Обращение = Обращение;
		НовДок.Исполнитель = Исполнитель;
		НовДок.Часы = Часы;
		НовДок.ДатаРабот = ДатаРабот;
		НовДок.Комментарий = Комментарий;     
		НовДок.Дата = ТекущаяДатаСеанса();
		НовДок.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Обращение = Параметры.Обращение;
	
	Если Параметры.Свойство("Регистратор") Тогда 
		
		Регистратор = Параметры.Регистратор;
		НовДок = Регистратор.ПолучитьОбъект();
		Исполнитель = НовДок.Исполнитель;
		Часы = НовДок.Часы;
		ДатаРабот = НовДок.ДатаРабот;
		Комментарий = НовДок.Комментарий;     
		ДатаРабот = НовДок.ДатаРабот;
		
	КонецЕсли;
	
КонецПроцедуры
