
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	Элементы.Наименование.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	СписокТрудозатрат.Параметры.УстановитьЗначениеПараметра("Обращение", Объект.Ссылка);
	СписокТрудозатрат.Параметры.УстановитьЗначениеПараметра("Исполнитель", Пользователи.ТекущийПользователь());
	
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьЧасы(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ВводЧасов",Новый Структура("Обращение", Объект.Ссылка));
	
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокТрудозатрат

&НаКлиенте
Процедура СписокТрудозатратВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьФорму("ОбщаяФорма.ВводЧасов",Новый Структура("Обращение, Регистратор", 
		Объект.Ссылка, Элемент.ТекущиеДанные.Регистратор));
			
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не Отказ И Модифицированность Тогда 
		ЗаписатьСостояниеОбращенийНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьСостояниеОбращенийНаСервере()  
	
	ДатаСеанса = ТекущаяДатаСеанса();
	СтруктураОбращения = Новый Структура("Обращение, Сотрудник, Статус, СлужебныйКомментарий");
	СтруктураОбращения.Обращение = Объект.Ссылка;
	СтруктураОбращения.Статус = Объект.Статус;

	НовоеОбращение = Ложь;
	Если Объект.Статус = Перечисления.СтатусыОбращения.Новое Тогда 
		НовоеОбращение = Истина;			
	КонецЕсли;
	
	Если НовоеОбращение Тогда  	
		СтруктураОбращения.Сотрудник = Справочники.Пользователи.СистемныйПользователь;
		СтруктураОбращения.СлужебныйКомментарий = СтрШаблон("Создано новое обращение. Автор обращения: %1", Объект.Автор); 
	Иначе
		Отбор = Новый Структура;
		Отбор.Вставить("Обращение", Объект.Ссылка);
		ПоследнееОбращение = РегистрыСведений.СостояниеОбращений;
		ТекВерсияОбращения = ПоследнееОбращение.ПолучитьПоследнее(ДатаСеанса, Отбор);
		
		Если ТекВерсияОбращения.Статус = Объект.Статус Тогда 
			Возврат;
		Иначе  
			СтруктураОбращения.Сотрудник = Объект.Исполнитель;
			Если Объект.Статус = Перечисления.СтатусыОбращения.Новое Тогда  
				СтруктураОбращения.СлужебныйКомментарий = СтрШаблон("Создано новое обращение. Автор обращения: %1", Объект.Автор); 	
			ИначеЕсли Объект.Статус = Перечисления.СтатусыОбращения.ВРаботе Тогда 
				СтруктураОбращения.СлужебныйКомментарий = СтрШаблон("Обращение принято в работу. Исполнитель: %1", Объект.Исполнитель); 
			ИначеЕсли Объект.Статус = Перечисления.СтатусыОбращения.ОжидаетКлиента Тогда 
				СтруктураОбращения.СлужебныйКомментарий = СтрШаблон("Обращение передано клиенту: %1", Объект.Автор);
			ИначеЕсли Объект.Статус = Перечисления.СтатусыОбращения.Закрыто Тогда 	
				СтруктураОбращения.СлужебныйКомментарий = СтрШаблон("Обращение закрыто"); 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	НаборЗаписей = РегистрыСведений.СостояниеОбращений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Обращение.Установить(Объект.Ссылка); 
	НаборЗаписей.Отбор.Период.Установить(ДатаСеанса);
	
	Запись = НаборЗаписей.Добавить(); 
	ЗаполнитьЗначенияСвойств(Запись, СтруктураОбращения);
	Запись.Период = ДатаСеанса;
	
	НаборЗаписей.Записать();	
КонецПроцедуры

#КонецОбласти