
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	Элементы.Наименование.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	СписокТрудозатрат.Параметры.УстановитьЗначениеПараметра("Обращение", Объект.Ссылка);
	СписокТрудозатрат.Параметры.УстановитьЗначениеПараметра("Исполнитель", Пользователи.ТекущийПользователь());
	
	Если Объект.Ссылка.Пустая() Тогда 
		Объект.Статус = Перечисления.СтатусыОбращения.Новое;
	КонецЕсли;
	ПриоритетОбращения = Объект.Приоритет;
	ИсполнительНазначен = Ложь;
	СтатусВРаботе = Перечисления.СтатусыОбращения.ВРаботе;
	
	Если ПриоритетОбращения = Перечисления.ПриоритетыОбращения.Срочный Тогда
		
	    МинимальныйТребуемыйБалл = 4;
	    
	ИначеЕсли ПриоритетОбращения = Перечисления.ПриоритетыОбращения.Высокий Тогда
		
	    МинимальныйТребуемыйБалл = 3;
	    
	ИначеЕсли ПриоритетОбращения = Перечисления.ПриоритетыОбращения.Средний Тогда
		
	    МинимальныйТребуемыйБалл = 2;
	    
	Иначе
		
	    МинимальныйТребуемыйБалл = 0; 
	    
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Обращения.Исполнитель КАК Исполнитель,
		|	КОЛИЧЕСТВО(Обращения.Ссылка) КАК КоличествоОбращений
		|ПОМЕСТИТЬ втЗанятость
		|ИЗ
		|	Справочник.Обращения КАК Обращения
		|ГДЕ
		|	Обращения.Статус = &Статус
		|СГРУППИРОВАТЬ ПО
		|	Обращения.Исполнитель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НавыкиСотрудников.Сотрудник КАК Сотрудник,
		|	НавыкиСотрудников.КоличествоБаллов / НавыкиСотрудников.КоличествоВопросов КАК СреднийБалл,
		|	втЗанятость.КоличествоОбращений КАК КоличествоОбращений
		|ИЗ
		|	втЗанятость КАК втЗанятость
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НавыкиСотрудников КАК НавыкиСотрудников
		|		ПО втЗанятость.Исполнитель = НавыкиСотрудников.Сотрудник
		|
		|УПОРЯДОЧИТЬ ПО
		|	КоличествоОбращений";
	
	Запрос.УстановитьПараметр("Статус", СтатусВРаботе);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.СреднийБалл = NULL Тогда 
		Если Выборка.СреднийБалл > МинимальныйТребуемыйБалл Тогда
			
    		Объект.Исполнитель = Выборка.Исполнитель;
    		ИсполнительНазначен = Истина;
    		Продолжить;
    		
		КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ИсполнительНазначен Тогда
		
		Сообщить("Не удалось автоматически подобрать оптимального Исполнителя");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьЧасы(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ВводЧасов",Новый Структура("Обращение", Объект.Ссылка));
	
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокТрудозатрат

&НаКлиенте
Процедура СписокТрудозатратВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьФорму("ОбщаяФорма.ВводЧасов",Новый Структура("Обращение, Регистратор", 
		Объект.Ссылка, Элемент.ТекущиеДанные.Регистратор));
			
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не Отказ И Модифицированность Тогда 
		ЗаписатьСостояниеОбращенийНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьСостояниеОбращенийНаСервере()  
	
	ДатаСеанса = ТекущаяДатаСеанса();
	СтруктураОбращения = Новый Структура("Обращение, Сотрудник, Статус, СлужебныйКомментарий");
	СтруктураОбращения.Обращение = Объект.Ссылка;
	СтруктураОбращения.Статус = Объект.Статус;

	НовоеОбращение = Ложь;
	Если Объект.Статус = Перечисления.СтатусыОбращения.Новое Тогда 
		НовоеОбращение = Истина;			
	КонецЕсли;
	
	Если НовоеОбращение Тогда  	
		СтруктураОбращения.Сотрудник = Справочники.Пользователи.СистемныйПользователь;
		СтруктураОбращения.СлужебныйКомментарий = СтрШаблон("Создано новое обращение. Автор обращения: %1", Объект.Автор); 
	Иначе
		Отбор = Новый Структура;
		Отбор.Вставить("Обращение", Объект.Ссылка);
		ПоследнееОбращение = РегистрыСведений.СостояниеОбращений;
		ТекВерсияОбращения = ПоследнееОбращение.ПолучитьПоследнее(ДатаСеанса, Отбор);
		
		Если ТекВерсияОбращения.Статус = Объект.Статус Тогда 
			Возврат;
		Иначе  
			СтруктураОбращения.Сотрудник = Объект.Исполнитель;
			Если Объект.Статус = Перечисления.СтатусыОбращения.Новое Тогда  
				СтруктураОбращения.СлужебныйКомментарий = СтрШаблон("Создано новое обращение. Автор обращения: %1", Объект.Автор); 	
			ИначеЕсли Объект.Статус = Перечисления.СтатусыОбращения.ВРаботе Тогда 
				СтруктураОбращения.СлужебныйКомментарий = СтрШаблон("Обращение принято в работу. Исполнитель: %1", Объект.Исполнитель); 
			ИначеЕсли Объект.Статус = Перечисления.СтатусыОбращения.ОжидаетКлиента Тогда 
				СтруктураОбращения.СлужебныйКомментарий = СтрШаблон("Обращение передано клиенту: %1", Объект.Автор);
			ИначеЕсли Объект.Статус = Перечисления.СтатусыОбращения.Закрыто Тогда 	
				СтруктураОбращения.СлужебныйКомментарий = СтрШаблон("Обращение закрыто"); 
			КонецЕсли; 
			
			Решение = 0;
			Реакция = 0;
			Если ТекВерсияОбращения.Статус = Перечисления.СтатусыОбращения.Новое И Объект.Статус = Перечисления.СтатусыОбращения.ВРаботе Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	РАЗНОСТЬДАТ(СостояниеОбращенийСрезПервых.Период, &ТекПериод, МИНУТА) КАК Реакция
				|ИЗ
				|	РегистрСведений.СостояниеОбращений.СрезПервых КАК СостояниеОбращенийСрезПервых
				|ГДЕ
				|	СостояниеОбращенийСрезПервых.Обращение = &Обращение
				|	И СостояниеОбращенийСрезПервых.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбращения.Новое)";
				
				Запрос.УстановитьПараметр("Обращение", Объект.Ссылка);
				Запрос.УстановитьПараметр("ТекПериод", ДатаСеанса);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Реакция = ВыборкаДетальныеЗаписи.Реакция; 
				КонецЦикла;
				
			ИначеЕсли ТекВерсияОбращения.Статус = Перечисления.СтатусыОбращения.ВРаботе И Объект.Статус = Перечисления.СтатусыОбращения.ОжидаетКлиента Тогда 
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	РАЗНОСТЬДАТ(СостояниеОбращенийСрезПоследних.Период, &ТекПериод, МИНУТА) КАК Решение
				|ИЗ
				|	РегистрСведений.СостояниеОбращений.СрезПоследних КАК СостояниеОбращенийСрезПоследних
				|ГДЕ
				|	СостояниеОбращенийСрезПоследних.Обращение = &Обращение
				|	И СостояниеОбращенийСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбращения.ВРаботе)";
				
				Запрос.УстановитьПараметр("Обращение", Объект.Ссылка); 
				Запрос.УстановитьПараметр("ТекПериод", ДатаСеанса);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Решение = ВыборкаДетальныеЗаписи.Решение; 
				КонецЦикла;		
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;	
	
	Запись = РегистрыСведений.ПоказателиSLAПоОбращениям.СоздатьМенеджерЗаписи();
    Запись.Обращение = Объект.Ссылка;
    Запись.Прочитать();

    Если Запись.Выбран() Тогда
        Запись.Реакция = Запись.Реакция + Реакция;
        Запись.Решение = Запись.Решение + Решение;
        Запись.Записать(Истина);
    Иначе
        Запись.Обращение = Объект.Ссылка;
        Запись.Реакция = Реакция;
        Запись.Решение = Решение;
        Запись.Записать(Истина);
    КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.СостояниеОбращений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Обращение.Установить(Объект.Ссылка); 
	НаборЗаписей.Отбор.Период.Установить(ДатаСеанса);
	
	Запись = НаборЗаписей.Добавить(); 
	ЗаполнитьЗначенияСвойств(Запись, СтруктураОбращения);
	Запись.Период = ДатаСеанса;
	
	НаборЗаписей.Записать();	
КонецПроцедуры

#КонецОбласти