
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	Элементы.Наименование.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	СписокТрудозатрат.Параметры.УстановитьЗначениеПараметра("Обращение", Объект.Ссылка);
	СписокТрудозатрат.Параметры.УстановитьЗначениеПараметра("Исполнитель", Пользователи.ТекущийПользователь());
	
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьЧасы(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ВводЧасов",Новый Структура("Обращение", Объект.Ссылка));
	
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокТрудозатрат

&НаКлиенте
Процедура СписокТрудозатратВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьФорму("ОбщаяФорма.ВводЧасов",Новый Структура("Обращение, Регистратор", 
		Объект.Ссылка, Элемент.ТекущиеДанные.Регистратор));
			
КонецПроцедуры

#КонецОбласти