 
 
&НаКлиенте
Процедура Принять(Команда)
	ПринятьНаСервере();  
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПринятьНаСервере()
	НовДок = Документы.РаботаПоОбращению.СоздатьДокумент();
	НовДок.Обращение = Обращение;
	НовДок.Часы = Часы;
	НовДок.Комментарий = Комментарий;     
	НовДок.Дата = ТекущаяДатаСеанса();
	НовДок.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Обращение = Параметры.Обращение;
КонецПроцедуры
