
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Настройки = КомпоновщикНастроек.Настройки;
    Сотрудник = Настройки.ПараметрыДанных.Элементы.Найти("Сотрудник");
    Сотрудник.Значение = Пользователи.ТекущийПользователь();
    Сотрудник.Использование = Истина;    
	Период = Настройки.ПараметрыДанных.Элементы.Найти("Период");
    Период.Значение = ТекущаяДатаСеанса();
    Период.Использование = Истина;

КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
