
#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Токен доступа бота - Строка
Функция ПолучитьСообщения() Экспорт

	ТокенДоступаБота = "8208081640:AAEM-yihcdF685N8OEF9YYg5-7L6iBhPT5w";
	Соединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL());
	Заголовки   = Новый Соответствие;
	Заголовки.Вставить("content-type", "application/json");
	Запрос = Новый HTTPЗапрос("bot" + ТокенДоступаБота + "/getUpdates", Заголовки);
	Ответ = Соединение.Получить(Запрос);
	ОтветСтрока = ответ.ПолучитьТелоКакСтроку();
	ЧтениеJSON	= Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ОтветСтрока);	
	Данные = ПрочитатьJSON(ЧтениеJSON);
		
	ЧтениеJSON.Закрыть();
	
	Если Данные.ok Тогда
		
		ПолученныеСообщения = Новый Соответствие;
		
		Для Каждого Сообщение из Данные.result Цикл
			
			ПолученныеСообщения.Вставить(СтрЗаменить(Строка(Сообщение.update_id)," ",""), Сообщение.message);
		
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ОбращенияТГ.Запись КАК Запись
			|ИЗ
			|	РегистрСведений.ОбращенияТГ КАК ОбращенияТГ";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ПолученныеСообщения.Удалить(Выборка.Запись); //закомментить для теста
			
		КонецЦикла;
		
		
		Для Каждого НовоеСообщение из ПолученныеСообщения Цикл
			
			Запись = РегистрыСведений.ОбращенияТГ.СоздатьМенеджерЗаписи();
	    	Запись.Запись = НовоеСообщение.Ключ;
	    	Запись.Записать(Истина);
			
			ОтправитьЗапрос(НовоеСообщение.Значение.text, НовоеСообщение.Значение.chat.id);
		
		КонецЦикла;
		
		
	КонецЕсли;

КонецФункции

Процедура ОтправитьЗапрос(ТекстЗапроса, ЧатИД)
    
    // Проверяем на клиенте, что текст заполнен
    Если ПустаяСтрока(ТекстЗапроса) Тогда
        Сообщить("Введите текст обращения");
        Возврат;
    КонецЕсли;
    
    МодельИИ = Перечисления.МоделиИИ.RuBert;

	Если МодельИИ = ПредопределенноеЗначение("Перечисление.МоделиИИ.RuBert") Тогда 
    	// Вызываем серверную процедуру
    	Результат = ОтправитьЗапросИСоздатьОбращениеНаСервере(ТекстЗапроса, ЧатИД);
	Иначе
		ОтветЗапроса = СРОО_ОбщегоНазначения.ПолучитьСообщениеGemini(ТекстЗапроса);
		Результат = Истина;
	КонецЕсли;
    
    Если Результат Тогда
        Сообщить("Обращение успешно создано!");
        ТекстЗапроса = ""; // Очищаем поле
    Иначе
        Сообщить("Не удалось создать обращение");
    КонецЕсли;
    
КонецПроцедуры

Функция ОтправитьЗапросИСоздатьОбращениеНаСервере(ТекстЗапроса, ЧатИД)
    
    // Отправляем запрос к ML-серверу
    ОтветСервера = СРОО_ОбщегоНазначения.ОтправитьЗапросКСерверу(ТекстЗапроса);
    Если ОтветСервера = Неопределено Тогда
        Возврат Ложь;
    КонецЕсли;
    
    // Создаем обращение в базе данных
    Результат = СРОО_ОбщегоНазначения.СоздатьОбращениеВБазе(ТекстЗапроса, ОтветСервера, Перечисления.ИсточникиОбращений.Телеграм, ЧатИД);
    
    Возврат Результат;
    
КонецФункции

#КонецОбласти
