
Функция ПолучитьПоказателиSLA(Обращение) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоказателиSLAПоОбращениям.Реакция КАК Реакция,
		|	ПоказателиSLAПоОбращениям.Решение КАК Решение
		|ИЗ
		|	РегистрСведений.ПоказателиSLAПоОбращениям КАК ПоказателиSLAПоОбращениям
		|ГДЕ
		|	ПоказателиSLAПоОбращениям.Обращение = &Обращение";
	
	Запрос.УстановитьПараметр("Обращение", Обращение);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Новый Структура("Реакция, Решение", Число(ВыборкаДетальныеЗаписи.Реакция), Число(ВыборкаДетальныеЗаписи.Решение));
	КонецЦикла;
	
КонецФункции