//@НаСервере
//структура ОбращениеСтруктура
//    обз пер ЗаголовокОбращения: Строка
//    обз пер ТекстОбращения: Строка
//    обз пер Код: Строка
//    обз пер ДатаСоздания: ДатаВремя
//    обз пер ФиоИсполнителя: Строка
//    обз пер ФиоАвтора: Строка
//    обз пер Статус: Строка
//    обз пер УуидЭлемента: Строка
//    обз пер УуидПредприятия: Строка
//    обз пер КомментарииТЧ: Массив<СтруктураТЧ>
//;

//@НаСервере
//структура СтруктураТЧ
//    обз пер Дата: ДатаВремя
//    обз пер Комментарий: Строка
//    обз пер ФиоАвтор: Строка
//;

Функция requestPUT(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Попытка
		
		ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку("UTF-8"); 
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТелоЗапроса);
		
		СтруктураЗапр = ПрочитатьJSON(ЧтениеJSON, Истина); 
		//МассивНаимМОЛ = СтруктураЗапр["НаимМОЛ"]; 
		
		УуидПредприятия = СтруктураЗапр["УуидПредприятия"];
		
		Ууид = Новый УникальныйИдентификатор(УуидПредприятия);
		
		ОбращенияСсылка = Справочники.Обращения.ПолучитьСсылку(Ууид);
		
		Если ОбращенияСсылка.Пустая() Тогда 
			ОбращенияОбъект = Справочники.Обращения.СоздатьЭлемент();	
		Иначе
			ОбращенияОбъект = ОбращенияСсылка.ПолучитьОбъект();	
		КонецЕсли;
		
		ОбращенияОбъект.Наименование = СтруктураЗапр["ЗаголовокОбращения"];
		ОбращенияОбъект.ТекстОбращения = СтруктураЗапр["ТекстОбращения"];
		ОбращенияОбъект.Код = СтруктураЗапр["Код"];       
		ОбращенияОбъект.ДатаСоздания = СтруктураЗапр["ДатаСоздания"];    
		ОбращенияОбъект.Статус = СтруктураЗапр["Статус"];
		ОбращенияОбъект.УуидЭлемента = СтруктураЗапр["УуидЭлемента"]; 
		ОбращенияОбъект.УуидПредприятия = СтруктураЗапр["УуидПредприятия"];
		ОбращенияОбъект.Исполнитель = Справочники.Пользователи.НайтиПоНаименованию(СтруктураЗапр["ФиоИсполнителя"]); 
		//ОбращенияОбъект.Автор = Справочники.КлиентыCRM.НайтиПоНаименованию(СтруктураЗапр["ФиоАвтора"]);
		
		ОбращенияОбъект.Источник = Перечисления.ИсточникиОбращений.Сайт;
		
		ОбращенияОбъект.Комментарии.Очистить();
		Для Каждого Элем Из СтруктураЗапр["КомментарииТЧ"] Цикл
			НовСтр = ОбращенияОбъект.Комментарии.Добавить();
			//НовСтр.Автор = Справочники.КлиентыCRM.НайтиПоНаименованию(СтруктураЗапр["ФиоАвтор"]);
			НовСтр.Дата = Дата(Элем["Дата"]);
			НовСтр.Комментарий = Элем["Комментарий"]; 
		КонецЦикла;
		ОбращенияОбъект.Записать();
		
		Если ОбращенияОбъект.УуидПредприятия = "00000000-0000-0000-0000-000000000000" ИЛИ ПустаяСтрока(ОбращенияОбъект.УуидПредприятия) Тогда 
			ОбращенияОбъект.УуидПредприятия = Строка(ОбращенияОбъект.Ссылка.УникальныйИдентификатор());	
			ОбращенияОбъект.Записать();
		КонецЕсли;
		
		СтруктураОтвета = Новый Структура("Успешно, УуидПредприятия", Истина, ОбращенияОбъект.УуидПредприятия);
		
		JSONответ = Новый ЗаписьJSON;
		JSONответ.УстановитьСтроку();
		ЗаписатьJSON(JSONответ, СтруктураОтвета); 
		Отв = JSONответ.Закрыть(); 
		
		Ответ.УстановитьТелоИзСтроки(Отв);
		Возврат Ответ;  
		
	Исключение 
		
		СтруктураОтвета = Новый Структура("Успешно, УуидПредприятия", Ложь, "");

		JSONответ = Новый ЗаписьJSON;
		JSONответ.УстановитьСтроку();
		ЗаписатьJSON(JSONответ, СтруктураОтвета); 
		Отв = JSONответ.Закрыть(); 
		
		Ответ.УстановитьТелоИзСтроки(Отв);
		Возврат Ответ;
		
	КонецПопытки;	
КонецФункции
