//@НаСервере
//структура ОбращениеСтруктура
//    обз пер ЗаголовокОбращения: Строка
//    обз пер ТекстОбращения: Строка
//    обз пер Код: Строка
//    обз пер ДатаСоздания: ДатаВремя
//    обз пер ФиоИсполнителя: Строка
//    обз пер ФиоАвтора: Строка
//    обз пер Статус: Строка
//    обз пер УуидЭлемента: Строка
//    обз пер УуидПредприятия: Строка
//    обз пер КомментарииТЧ: Массив<СтруктураТЧ>
//;

//@НаСервере
//структура СтруктураТЧ
//    обз пер Дата: ДатаВремя
//    обз пер Комментарий: Строка
//    обз пер ФиоАвтор: Строка
//;

Функция requestPUT(Запрос)
	
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку("UTF-8"); 
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТелоЗапроса);
	
	СтруктураЗапр = ПрочитатьJSON(ЧтениеJSON, Истина); 
	
	Попытка
		
		УуидПредприятия = СтруктураЗапр["УуидПредприятия"]; 
		
		Если ПустаяСтрока(УуидПредприятия) Тогда 
			ПустойУуид = Истина;
			ОбращенияСсылка = Справочники.Обращения.ПустаяСсылка();
		Иначе 
			ПустойУуид = Ложь;
			Ууид = Новый УникальныйИдентификатор(УуидПредприятия);
			ОбращенияСсылка = Справочники.Обращения.ПолучитьСсылку(Ууид);
		КонецЕсли;
		
		Если ПустойУуид ИЛИ ОбращенияСсылка.Пустая() Тогда 
			
			СпрИсточникСсылка = Справочники.ИсточникиОбращений.НайтиПоРеквизиту("УникальноеЗначениеДляПоиска", СтруктураЗапр["УуидЭлемента"]);
			Если СпрИсточникСсылка.Пустая() Тогда 
				СпрИсточникОбъект = Справочники.ИсточникиОбращений.СоздатьЭлемент();
			Иначе
				СпрИсточникОбъект = СпрИсточникСсылка.ПолучитьОбъект();	
			КонецЕсли; 
			
			СпрИсточникОбъект.АвторОбращения = СтруктураЗапр["ФиоАвтора"]; 
			СпрИсточникОбъект.СсылкаНаАвтора = СРОО_ОбщегоНазначения.ПолучитьАвтораПоФИО(СтруктураЗапр["ФиоАвтора"]);
			СпрИсточникОбъект.ИсточникОбращения = Перечисления.ИсточникиОбращений.Сайт;
			СпрИсточникОбъект.ТемаОбращения = СтруктураЗапр["ЗаголовокОбращения"];
			СпрИсточникОбъект.ТекстОбращения = СтруктураЗапр["ТекстОбращения"];
			СпрИсточникОбъект.УникальноеЗначениеДляПоиска = СтруктураЗапр["УуидЭлемента"]; 
			СпрИсточникОбъект.Статус = Перечисления.СтатусыОбработки.КОбработке;
			
			СпрИсточникОбъект.ДопСвойства.Очистить();
			НовСтр = СпрИсточникОбъект.ДопСвойства.Добавить();
			НовСтр.Свойство = "УуидЭлемента";
			НовСтр.Значение = СтруктураЗапр["УуидЭлемента"];
			
			СпрИсточникОбъект.Наименование = СтрШаблон("%1 №%2", СпрИсточникОбъект.ТемаОбращения, СпрИсточникОбъект.Код);
			
            СпрИсточникОбъект.Записать();
			СпрИсточникОбъект.Наименование = СтрШаблон("Обращение №%1 Сайт", СпрИсточникОбъект.Код);
			СпрИсточникОбъект.Записать();
			
			ДатаСеанса = ТекущаяДатаСеанса();
			СтруктураHTTPЗапроса = Новый Структура;
			СтруктураHTTPЗапроса.Вставить("ОбъектЗапроса", СпрИсточникОбъект.Ссылка);
			СтруктураHTTPЗапроса.Вставить("Действие", Перечисления.ДействияHTTPЗапросов.СозданиеИсточникаДаннымиИзЭлемента);
			СтруктураHTTPЗапроса.Вставить("Код", 200);
			СтруктураHTTPЗапроса.Вставить("Описание", "Источник обращения успешно создан и заполнен данными из 1С-Элемента");
			
			СРОО_ОбщегоНазначения.ЗаполнитьСтатусHTTPЗапроса(ДатаСеанса, СпрИсточникОбъект.Ссылка, СтруктураHTTPЗапроса);
			
			
			Ответ = Новый HTTPСервисОтвет(200);
			Возврат Ответ;
			
		Иначе
			ОбращенияОбъект = ОбращенияСсылка.ПолучитьОбъект();		
		КонецЕсли;
		
		Если СтруктураЗапр["Статус"] = "ВРаботе" Тогда 
            ОбращенияОбъект.Статус = Перечисления.СтатусыОбращения.ВРаботе;
        ИначеЕсли СтруктураЗапр["Статус"] = "ОжидаетКлиента" Тогда
            ОбращенияОбъект.Статус = Перечисления.СтатусыОбращения.ОжидаетКлиента;
        ИначеЕсли СтруктураЗапр["Статус"] = "Закрыто" Тогда
            ОбращенияОбъект.Статус = Перечисления.СтатусыОбращения.Закрыто;
        ИначеЕсли СтруктураЗапр["Статус"] = "Новое" Тогда
            ОбращенияОбъект.Статус = Перечисления.СтатусыОбращения.Новое;
        ИначеЕсли СтруктураЗапр["Статус"] = "ВозвращеноКлиентом" Тогда
            ОбращенияОбъект.Статус = Перечисления.СтатусыОбращения.ВозвращеноКлиентом;
        КонецЕсли;
				
		ПараметрыОтбора = Новый Структура("Внешний", Ложь);	 	
		ТЗисходн = ОбращенияОбъект.Комментарии.Выгрузить(); 
		ТЗнов = ТЗисходн.Скопировать(ПараметрыОтбора); 
		ОбращенияОбъект.Комментарии.Очистить(); 		
		ОбращенияОбъект.Комментарии.Загрузить(ТЗнов); 
		
		Для Каждого Элем Из СтруктураЗапр["КомментарииТЧ"] Цикл
			НовСтр = ОбращенияОбъект.Комментарии.Добавить();
			НовСтр.Автор = СРОО_ОбщегоНазначения.ПолучитьАвтораПоФИО(СтруктураЗапр["ФиоАвтор"]);  
			СтрокаДата = Элем["Дата"];
    		СтрокаДата = СтрЗаменить(СтрокаДата, "T", " ");
    		СтрокаДата = СтрЗаменить(СтрокаДата, "-", "");
    		СтрокаДата = СтрЗаменить(СтрокаДата, ":", "");
    		СтрокаДата = СтрЗаменить(СтрокаДата, " ", "");
			НовСтр.Дата = СтрокаДата;
			НовСтр.Комментарий = Элем["Комментарий"]; 
			НовСтр.Внешний = Истина;
		КонецЦикла;  
	
		СРОО_ОбщегоНазначения.ЗаписатьСостояниеОбращенийНаСервере(ОбращенияОбъект);	
		
		ОбращенияОбъект.Записать();
		
		ДатаСеанса = ТекущаяДатаСеанса();
		СтруктураHTTPЗапроса = Новый Структура;
		СтруктураHTTPЗапроса.Вставить("ОбъектЗапроса", ОбращенияОбъект.Ссылка);
		СтруктураHTTPЗапроса.Вставить("Действие", Перечисления.ДействияHTTPЗапросов.ОбновлениеОбращенийДаннымиИзЭлемента);
        СтруктураHTTPЗапроса.Вставить("Код", 200);
		СтруктураHTTPЗапроса.Вставить("Описание", "Обращение успешно обновленно данными из 1С-Элемента");
		
		СРОО_ОбщегоНазначения.ЗаполнитьСтатусHTTPЗапроса(ДатаСеанса, ОбращенияОбъект.Ссылка, СтруктураHTTPЗапроса);

		
		Ответ = Новый HTTPСервисОтвет(200);
		Возврат Ответ;  
		
	Исключение 
		
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки(ОписаниеОшибки());
		
		ДатаСеанса = ТекущаяДатаСеанса();
		СтруктураHTTPЗапроса = Новый Структура;
		СтруктураHTTPЗапроса.Вставить("ОбъектЗапроса", СтруктураЗапр["УуидЭлемента"]);
		СтруктураHTTPЗапроса.Вставить("Действие", Перечисления.ДействияHTTPЗапросов.ПолучениеДанныхИзЭлемента);
		СтруктураHTTPЗапроса.Вставить("Код", 500);
		СтруктураHTTPЗапроса.Вставить("Описание", ОписаниеОшибки());
		
		СРОО_ОбщегоНазначения.ЗаполнитьСтатусHTTPЗапроса(ДатаСеанса, СтруктураЗапр["УуидЭлемента"], СтруктураHTTPЗапроса);

		Возврат Ответ;
		
	КонецПопытки;	
КонецФункции
