
&НаКлиенте
Процедура Ответить(Команда)
	ОтветитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтветитьНаСервере()
	Письмо = новый ИнтернетПочтовоеСообщение;
	Письмо.Получатели.Добавить(АдресПолучателя);
	Письмо.Копии.Добавить(Копия);
	Письмо.Тексты.Добавить(ТекстСообщения);
	
	РезультатОтправки = РаботаСПочтовымиСообщениями.ОтправитьПисьмо(
		Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты, Письмо);
		
	Если ЗначениеЗаполнено(РезультатОтправки.ИдентификаторПисьмаSMTP) Тогда
		Сообщить("Письмо успешно отправлено.");
	Иначе
		Сообщить("Не удалось отправить письмо");
	КонецЕсли;
КонецПроцедуры
