Функция ПолучитьНастройкиПодключения(НастройкаАккаунтаСсылка) Экспорт
   	Результат = новый Структура;
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиПодключения.Ссылка КАК Ссылка,
	               |	НастройкиПодключения.ВерсияДанных КАК ВерсияДанных,
	               |	НастройкиПодключения.ПометкаУдаления КАК ПометкаУдаления,
	               |	НастройкиПодключения.Код КАК Код,
	               |	НастройкиПодключения.Наименование КАК Наименование,
	               |	НастройкиПодключения.Логин КАК Логин,
	               |	НастройкиПодключения.Пароль КАК Пароль,
	               |	НастройкиПодключения.URL КАК URL,
				   |	НастройкиПодключения.Порт КАК Порт,
	               |	НастройкиПодключения.ТокенДоступа КАК ТокенДоступа,
	               |	НастройкиПодключения.ВызываемыеМетоды.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		ВызываемыйМетод КАК ВызываемыйМетод
	               |	) КАК ВызываемыеМетоды,
	               |	НастройкиПодключения.ЗаголовкиПодключения.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Заголовок КАК Заголовок,
	               |		Значение КАК Значение
	               |	) КАК ЗаголовкиПодключения,
	               |	НастройкиПодключения.Предопределенный КАК Предопределенный,
	               |	НастройкиПодключения.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	               |ИЗ
	               |	Справочник.НастройкиПодключения КАК НастройкиПодключения
	               |ГДЕ
	               |	НастройкиПодключения.Ссылка = &НастройкаАккаунтаСсылка";
	Запрос.УстановитьПараметр("НастройкаАккаунтаСсылка", НастройкаАккаунтаСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	Результат.Вставить("Логин", Выборка.Логин);
	Результат.Вставить("Пароль", Выборка.Пароль);
	Результат.Вставить("URL", Выборка.URL);
	Результат.Вставить("Порт", Выборка.Порт);
	Результат.Вставить("ТокенДоступа", Выборка.ТокенДоступа);
	
	ВызываемыеМетоды = новый Массив;
	ВыборкаВызываемыеМетоды = Выборка.ВызываемыеМетоды.Выбрать();
	Пока ВыборкаВызываемыеМетоды.Следующий() Цикл
		ВызываемыеМетоды.Добавить(ВыборкаВызываемыеМетоды.ВызываемыйМетод);
	КонецЦикла;
	
	Результат.Вставить("ВызываемыеМетоды", ВызываемыеМетоды);
	Заголовки = новый Соответствие;
	ВыборкаЗаголовкиПодключения = Выборка.ЗаголовкиПодключения.Выбрать();
	Пока ВыборкаЗаголовкиПодключения.Следующий() Цикл
			Заголовки.Вставить(ВыборкаЗаголовкиПодключения.Заголовок, ВыборкаЗаголовкиПодключения.Значение);		
	КонецЦикла;
	Результат.Вставить("Заголовки", Заголовки);
	
	Возврат Результат;
	
	

КонецФункции
	