#Область ОбработчикиКоманд
&НаКлиенте
Процедура ОтправитьЗапрос(Команда)
    
    // Проверяем на клиенте, что текст заполнен
    Если ПустаяСтрока(ТекстЗапроса) Тогда
        Сообщить("Введите текст обращения");
        Возврат;
    КонецЕсли;

   Если МодельИИ = ПредопределенноеЗначение("Перечисление.МоделиИИ.RuBert") Тогда 
    // Вызываем серверную процедуру
    Результат = ОтправитьЗапросИСоздатьОбращениеНаСервере(ТекстЗапроса);
	Иначе
		ОтветЗапроса = СРОО_ОбщегоНазначения.ПолучитьСообщениеGemini(ТекстЗапроса);
		Результат = Истина;
	КонецЕсли;
    
    Если Результат Тогда
        Сообщить("Обращение успешно создано!");
        ТекстЗапроса = ""; // Очищаем поле
    Иначе
        Сообщить("Не удалось создать обращение");
    КонецЕсли;
    
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ОтправитьЗапросИСоздатьОбращениеНаСервере(ТекстЗапроса)
    
    // Отправляем запрос к ML-серверу
    ОтветСервера = СРОО_ОбщегоНазначения.ОтправитьЗапросКСерверу(ТекстЗапроса);
    Если ОтветСервера = Неопределено Тогда
        Возврат Ложь;
    КонецЕсли;
    
    // Создаем обращение в базе данных
    Результат = СРОО_ОбщегоНазначения.СоздатьОбращениеВБазе(ТекстЗапроса, ОтветСервера, Перечисления.ИсточникиОбращений.СозданиеИзФормыОбработки);
    
    Возврат Результат;
    
КонецФункции

#КонецОбласти