&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 Если Параметры.Свойство("Скрыть") И Параметры.Скрыть = Истина Тогда
        ЭтотОбъект.Видимость = Ложь;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    
    // Скрываем форму
    Видимость = Ложь;    
    // ОТЛАДКА
    Сообщить(">>> Форма мониторинга запущена!");
    
    // Первая проверка сразу
    ПроверитьНовыеОповещения();
    
    // Подключаем периодическую проверку каждые 30 секунд
    ПодключитьОбработчикОжидания("ПроверитьНовыеОповещения", 5);
    
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
    
    // Запрещаем закрытие формы (кроме завершения работы)
    Если НЕ ЗавершениеРаботы Тогда
        Отказ = Истина;
        Видимость = Ложь;
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНовыеОповещения()
    
    // ОТЛАДКА
    Сообщить(">>> Проверяю оповещения... " + ТекущаяДата());
    
    МассивОповещений = ПолучитьНепрочитанныеОповещенияНаСервере();
    
    // ОТЛАДКА
    Сообщить(">>> Найдено оповещений: " + МассивОповещений.Количество());
    
    Для Каждого Оповещение Из МассивОповещений Цикл
        
        // ОТЛАДКА
        Сообщить(">>> Показываю оповещение: " + Оповещение.Заголовок);
        
        ПоказатьОповещениеПользователюНаКлиенте(Оповещение);
        
        ОтметитьКакПрочитанноеНаСервере(
            Оповещение.Пользователь,
            Оповещение.ВремяСобытия,
            Оповещение.УникальныйКлюч
        );
        
    КонецЦикла;
    
КонецПроцедуры

&НаСервере
Функция ПолучитьНепрочитанныеОповещенияНаСервере()
    
    Возврат ОповещенияСервер.ПолучитьНепрочитанныеОповещения();
    
КонецФункции

&НаСервере
Процедура ОтметитьКакПрочитанноеНаСервере(Пользователь, ВремяСобытия, УникальныйКлюч)
    
    ОповещенияСервер.ОтметитьКакПрочитанное(Пользователь, ВремяСобытия, УникальныйКлюч);
    
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОповещениеПользователюНаКлиенте(ДанныеОповещения)
    
    Заголовок = ДанныеОповещения.Заголовок;
    ТекстПояснения = ДанныеОповещения.ТекстОповещения;
    НавигационнаяСсылка = ДанныеОповещения.НавигационнаяСсылка;
    УникальныйКлюч = ДанныеОповещения.УникальныйКлюч;
    
    Если ПустаяСтрока(НавигационнаяСсылка) Тогда
        НавигационнаяСсылка = "";
    КонецЕсли;
    
    ПоказатьОповещениеПользователя(
        Заголовок,
        НавигационнаяСсылка,
        ТекстПояснения,
        БиблиотекаКартинок.Информация,
        СтатусОповещенияПользователя.Важное,
        УникальныйКлюч
    );
        
КонецПроцедуры

