
Функция ПолучитьЗначениеМетрикSLA(ПриоритетОбращения, ТипОбращения) Экспорт 
	
	СтруктураМетрик = Новый Структура;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МетрикиSLA.Реакция КАК Реакция,
		|	МетрикиSLA.Решение КАК Решение
		|ИЗ
		|	РегистрСведений.МетрикиSLA КАК МетрикиSLA
		|ГДЕ
		|	МетрикиSLA.ТипОбращения = &ТипОбращения
		|	И МетрикиSLA.ПриоритетОбращения = &ПриоритетОбращения";
	
	Запрос.УстановитьПараметр("ПриоритетОбращения", ПриоритетОбращения);
	Запрос.УстановитьПараметр("ТипОбращения", ТипОбращения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Новый Структура("Реакция, Решение", Число(ВыборкаДетальныеЗаписи.Реакция), Число(ВыборкаДетальныеЗаписи.Решение));
	КонецЦикла;
	Возврат Новый Структура("Реакция, Решение", 0, 0);
		
КонецФункции